20230220101635-ai_core.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AI-Core</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">AI-Core</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0a2c588">code</a>
<ul>
<li><a href="#org347a944">pythonic refactoring</a>
<ul>
<li><a href="#orgdaca42d">dataclass</a></li>
<li><a href="#org1c9a2e6">ABC for expanding</a></li>
<li><a href="#orge34c00f">database technology (indexing, storage, DVC)</a></li>
<li><a href="#org70576c2">refactor in pytorch</a></li>
<li><a href="#org89eddae">transformer implementation</a></li>
</ul>
</li>
<li><a href="#org186d598">VCS (git)</a>
<ul>
<li><a href="#org3b18686">publishing</a></li>
<li><a href="#org6f4df21">subscription</a></li>
<li><a href="#org6138b3a">autotest</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcb062f7">Projects</a>
<ul>
<li><a href="#org2506752">development harness</a>
<ul>
<li><a href="#org5fe814d">DL model tuning</a></li>
</ul>
</li>
<li><a href="#org28f6bde">MLOps</a></li>
<li><a href="#orgf83bf48">debugging on the cloud</a></li>
<li><a href="#org7f5d130">database</a></li>
<li><a href="#org51fac51">docker compose, K8s</a></li>
</ul>
</li>
<li><a href="#orgb9d36ac">Deep Learning</a>
<ul>
<li><a href="#orgca9539f">Reinforcement learning</a>
<ul>
<li><a href="#org7a1aa48"><b>Offline reinforcement learning</b></a></li>
<li><a href="#org0e06714"><b>RLHF in VEOS (convergence boundary, performance enhancement)</b></a></li>
<li><a href="#orgb33b0a9">efficient search in memory （experience pool)</a></li>
<li><a href="#orgd3733a3">transformer based decision system</a></li>
<li><a href="#orgba370d8">Federated Learning</a></li>
</ul>
</li>
<li><a href="#orgd0b6abf">Generative model</a>
<ul>
<li><a href="#orgcd7d737"><b>Diffusion model</b></a></li>
<li><a href="#orgfab3f6c"><b>transformer application</b></a></li>
<li><a href="#orge016019"><b>Application of new TS features from EP</b></a></li>
</ul>
</li>
<li><a href="#org84b445e">transformer application in DRL and Generative modeling</a></li>
<li><a href="#org4cd5100">Foundational Model exploration</a>
<ul>
<li><a href="#org8bf6eb0">Image captioning (scene understanding)</a></li>
<li><a href="#org927a5c3">Policy selection/Planning with Instructions</a></li>
</ul>
</li>
<li><a href="#org3bb592c">Building TS foundation model</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       9dd3692c-6715-4515-abee-56fd244fe0df
</p>
<p>
<a href="./20231024150747-deep_learning_general_theory.html">deep learning</a>
</p>

<p>
<a href="./20220406135530-devel_project.html">devel-project</a>
</p>

<div id="outline-container-org0a2c588" class="outline-2">
<h2 id="org0a2c588">code</h2>
<div class="outline-text-2" id="text-org0a2c588">
</div>
<div id="outline-container-org347a944" class="outline-3">
<h3 id="org347a944">pythonic refactoring</h3>
<div class="outline-text-3" id="text-org347a944">
</div>
<div id="outline-container-orgdaca42d" class="outline-4">
<h4 id="orgdaca42d">dataclass</h4>
</div>
<div id="outline-container-org1c9a2e6" class="outline-4">
<h4 id="org1c9a2e6">ABC for expanding</h4>
<div class="outline-text-4" id="text-org1c9a2e6">
</div>
<ul class="org-ul">
<li><a id="orgff21e26"></a>RL toolkit<br /></li>
<li><a id="org281e229"></a>datastore (db, cluster)<br /></li>
<li><a id="orgcc916a8"></a>observation/flashing interface (EC1, iC1, &#x2026;)<br /></li>
<li><a id="orgf07552e"></a>Exception handling<br /></li>
</ul>
</div>
<div id="outline-container-orge34c00f" class="outline-4">
<h4 id="orge34c00f">database technology (indexing, storage, DVC)</h4>
</div>
<div id="outline-container-org70576c2" class="outline-4">
<h4 id="org70576c2">refactor in pytorch</h4>
</div>
<div id="outline-container-org89eddae" class="outline-4">
<h4 id="org89eddae">transformer implementation</h4>
</div>
</div>
<div id="outline-container-org186d598" class="outline-3">
<h3 id="org186d598">VCS (git)</h3>
<div class="outline-text-3" id="text-org186d598">
</div>
<div id="outline-container-org3b18686" class="outline-4">
<h4 id="org3b18686">publishing</h4>
</div>
<div id="outline-container-org6f4df21" class="outline-4">
<h4 id="org6f4df21">subscription</h4>
</div>
<div id="outline-container-org6138b3a" class="outline-4">
<h4 id="org6138b3a">autotest</h4>
</div>
</div>
</div>
<div id="outline-container-orgcb062f7" class="outline-2">
<h2 id="orgcb062f7">Projects</h2>
<div class="outline-text-2" id="text-orgcb062f7">
</div>
<div id="outline-container-org2506752" class="outline-3">
<h3 id="org2506752">development harness</h3>
<div class="outline-text-3" id="text-org2506752">
</div>
<div id="outline-container-org5fe814d" class="outline-4">
<h4 id="org5fe814d">DL model tuning</h4>
<div class="outline-text-4" id="text-org5fe814d">
</div>
<ul class="org-ul">
<li><a id="orgfecd85c"></a>training<br /></li>
<li><a id="orgac16ece"></a>testing<br /></li>
<li><a id="org9584127"></a>validation<br /></li>
<li><a id="orgae22352"></a>data pipeline<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org28f6bde" class="outline-3">
<h3 id="org28f6bde"><a href="./20211217115351-mlops.html">MLOps</a></h3>
</div>
<div id="outline-container-orgf83bf48" class="outline-3">
<h3 id="orgf83bf48">debugging on the cloud</h3>
</div>
<div id="outline-container-org7f5d130" class="outline-3">
<h3 id="org7f5d130">database</h3>
</div>
<div id="outline-container-org51fac51" class="outline-3">
<h3 id="org51fac51">docker compose, K8s</h3>
</div>
</div>
<div id="outline-container-orgb9d36ac" class="outline-2">
<h2 id="orgb9d36ac">Deep Learning</h2>
<div class="outline-text-2" id="text-orgb9d36ac">
</div>
<div id="outline-container-orgca9539f" class="outline-3">
<h3 id="orgca9539f">Reinforcement learning</h3>
<div class="outline-text-3" id="text-orgca9539f">
</div>
<div id="outline-container-org7a1aa48" class="outline-4">
<h4 id="org7a1aa48"><b>Offline reinforcement learning</b></h4>
</div>
<div id="outline-container-org0e06714" class="outline-4">
<h4 id="org0e06714"><b>RLHF in VEOS (convergence boundary, performance enhancement)</b></h4>
</div>
<div id="outline-container-orgb33b0a9" class="outline-4">
<h4 id="orgb33b0a9">efficient search in memory （experience pool)</h4>
</div>
<div id="outline-container-orgd3733a3" class="outline-4">
<h4 id="orgd3733a3">transformer based decision system</h4>
</div>
<div id="outline-container-orgba370d8" class="outline-4">
<h4 id="orgba370d8">Federated Learning</h4>
</div>
</div>
<div id="outline-container-orgd0b6abf" class="outline-3">
<h3 id="orgd0b6abf">Generative model</h3>
<div class="outline-text-3" id="text-orgd0b6abf">
</div>
<div id="outline-container-orgcd7d737" class="outline-4">
<h4 id="orgcd7d737"><b>Diffusion model</b></h4>
</div>
<div id="outline-container-orgfab3f6c" class="outline-4">
<h4 id="orgfab3f6c"><b>transformer application</b></h4>
</div>
<div id="outline-container-orge016019" class="outline-4">
<h4 id="orge016019"><b>Application of new TS features from EP</b></h4>
</div>
</div>
<div id="outline-container-org84b445e" class="outline-3">
<h3 id="org84b445e">transformer application in DRL and Generative modeling</h3>
</div>
<div id="outline-container-org4cd5100" class="outline-3">
<h3 id="org4cd5100">Foundational Model exploration</h3>
<div class="outline-text-3" id="text-org4cd5100">
</div>
<div id="outline-container-org8bf6eb0" class="outline-4">
<h4 id="org8bf6eb0">Image captioning (scene understanding)</h4>
</div>
<div id="outline-container-org927a5c3" class="outline-4">
<h4 id="org927a5c3">Policy selection/Planning with Instructions</h4>
</div>
</div>
<div id="outline-container-org3bb592c" class="outline-3">
<h3 id="org3bb592c">Building TS foundation model</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
